# todo: Заданы три числа в переменных x, y, z.
# Напечатать наибольшее из этих чисел.
# Пример:
# x = 10
# y = 15
# z = 2
# Ответ:
# Наибольшее число 15

# x = 10
# y = 15
# z = 2
# list = max(x,y,z) # с помощью max
#
# print("Наибольшее число", list )

xyz = [10, 15, 2]
xyz.sort() # с помощью sort
print(xyz[-1])



# Пример:
# x = 77
# y = 9
# z = 130
# Ответ:
# Наибольшее число 130

# x = 77
# y = 9
# z = 130
# list = max(x,y,z) # с помощью max
#
# print("Наибольшее число", list )


xyz = [77, 9, 130]
xyz.sort() # с помощью sort
print(xyz[-1])